In [1]:
# 경고메세지 끄기
import warnings
# 에러 메시지는 수정해야 하지만, warning 메시지는 무시해도 상관 없다.
warnings.filterwarnings(action='ignore')

# 다시 출력하게 하기
# warnings.filterwarnings(action='default')

In [2]:
# 필요 패키지 import
import pandas as pd
import numpy as np

### 데이터 프레임 생성 문제1 : df1 생성
- 데이터 : numpy 패키지의 randn 함수를 이용해서 난수 n 개 생성
- 행방향 인덱스(index) : 날짜 데이터
- 열방향 인덱스(column) : ['A','B','C','D']

- 코드 줄의 길이가 짧을수록 성농이 좋은 분석

In [3]:
# 2019년 1월1일 이후 일요일 날짜 6개를 생성하여 저장하시오
dates = pd.date_range(start='2019-01-01', periods=6, freq='w-sun')
dates

# dates = pd.date_range('20190101', periods=6, freq='w-sun')
# 20190101이 일요일이면 포함

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27',
               '2019-02-03', '2019-02-10'],
              dtype='datetime64[ns]', freq='W-SUN')

In [4]:
# 아래와 같은 DataFrame을 생성 하시오
df1 = pd.DataFrame(np.random.randn(6, 4),  # randn : 난수를 따르는 정규분포 생성
                  index = dates,
                  columns = ['A', 'B', 'C', 'D'])  
df1

                   A         B         C         D
2019-01-06 -1.031279 -0.237538  0.958361 -0.901165
2019-01-13  0.428198  1.419409  0.127796  0.413577
2019-01-20 -1.047928  0.630878 -2.116424  0.134227
2019-01-27  0.836819 -1.143763  1.878131  2.282686
2019-02-03  0.403725 -1.733942  0.488871 -0.747366
2019-02-10 -1.366528 -0.851038  0.332732  0.229403

In [5]:
# 예제 df4 생성
data = [[22, 60.1, 170.5, '남', '서울'], 
        [45, 51.3, 157.3, '여', '부산'], 
        [22, 68.3, 180.1, '남', '대구'],
        [33, 88.3, 190.2, '남', '제주'], 
        [27, 48.3, 160.1, '여', '강릉']]
df4 = pd.DataFrame(data, index=['홍길동', '이몽룡', '성춘향','변학도', '김연아'], 
                   columns=["나이", "몸무게", "키", "성별" ,"주소"])
df4

     나이   몸무게      키 성별  주소
홍길동  22  60.1  170.5  남  서울
이몽룡  45  51.3  157.3  여  부산
성춘향  22  68.3  180.1  남  대구
변학도  33  88.3  190.2  남  제주
김연아  27  48.3  160.1  여  강릉

##### 데이터프레임 전치 문제
- df4 데이터프레임을 전치 후에 df4_1로 저장하고 원본과 비교 출력 하시오.

In [6]:
df4_1 = df4.T

In [7]:
df4_1

       홍길동    이몽룡    성춘향    변학도    김연아
나이      22     45     22     33     27
몸무게   60.1   51.3   68.3   88.3   48.3
키    170.5  157.3  180.1  190.2  160.1
성별       남      여      남      남      여
주소      서울     부산     대구     제주     강릉

#### 인덱싱 문제
- 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나  처리하라.

In [8]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70]
}

columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]

df = pd.DataFrame(data, index=index, columns=columns)

# 문1. 모든 학생의 수학 점수를 시리즈로 나타낸다.
# 문2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
# 문3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
# 문4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
# 문5. 춘향의 점수를 데이터프레임으로 나타낸다.
# 문6. 향단의 점수를 시리즈로 나타낸다.

In [9]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [10]:
# 모든 학생의 수학 점수를 시리즈로 나타낸다.
df.수학

# df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [11]:
# 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어', '영어']]  # [인덱스[리스트]]

# df['국어':'영어'] 에러 발생 : 컬럼은 index 자체로 슬라이싱 불가

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [12]:
# 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
# df['평균점수'] = (df['국어']+df['영어']+df['수학'])/3

df['평균점수'] = df.mean(axis=1)
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [13]:
# pandas 출력 포맷팅 : 소수점이하 2자리
# 출력 자릿수는 2자리 변경하여 조절
# 출력 형식만 변경됨 (dtype은 그대로 유지)

pd.options.display.float_format = '{:.2f}'.format
df

# pd.options.display.float_format = '{:.0f}'.format - 정수형으로 표현 (소수점 X)

    국어  영어  수학  평균점수
춘향  80  90  90 86.67
몽룡  90  70  60 73.33
향단  70  60  80 70.00
방자  30  40  70 46.67

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 춘향 to 방자
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국어      4 non-null      int64
 1   영어      4 non-null      int64
 2   수학      4 non-null      int64
 3   평균점수    4 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 332.0+ bytes

In [15]:
# 정한 표기법을 원래 상태로 복귀 : None를 지정
pd.set_option('display.float_format', None)
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [16]:
# 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

df = df.drop(['평균점수'], axis = 1)
df.iloc[3, 1] = 80
df['평균점수'] = df.mean(axis=1)
df

# df['영어']['방자'] = 80
# df['평균점수'] = (df['국어']+df['영어']+df['수학'])/3  # 기존 컬럼 변경 (업데이트)
# df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [17]:
# 춘향의 점수를 데이터프레임으로 나타낸다.
# df[:'춘향'] : 0번 행이 춘향일 경우
# df['춘향':'춘향']  # df
df.loc[['춘향']]


# 몽룡의 점수를 데이터 프레임으로 나타내는 경우
# df['몽룡':'몽룡']  # df
df.loc[['몽룡']]

    국어  영어  수학       평균점수
몽룡  90  70  60  73.333333

In [18]:
# 향단의 점수 시리즈로
# 시리즈는 열방향 데이터일 경우에 추출 가능
# df.T['향단']
# df.loc['향단']  # 인덱서 사용 

df1 = df.T
df1
df1['향단']

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64